CSI API ETABS v1
cAnalysisResultsSetup.SetOptionBaseReactLoc Method
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int SetOptionBaseReactLoc(
	double GX,
	double GY,
	double GZ
)
Function SetOptionBaseReactLoc (
	GX As Double,
	GY As Double,
	GZ As Double
) As Integer
Dim instance As cAnalysisResultsSetup
Dim GX As Double
Dim GY As Double
Dim GZ As Double
Dim returnValue As Integer
returnValue = instance.SetOptionBaseReactLoc(GX,
	GY, GZ)
int SetOptionBaseReactLoc(
	double GX,
	double GY,
	double GZ
)
abstract SetOptionBaseReactLoc :
        GX : float *
        GY : float *
        GZ : float -> int
Parameters
GX
Type: System.Double
GY
Type: System.Double
GZ
Type: System.Double
Return Value
Type: Int32
See Also
Reference
cAnalysisResultsSetup Interface
ETABSv1 Namespace